export type FormQuestion = {
  id: string;
  question: string;
  options?: string[];
  type?: 'contact';
};

export const formQuestions: FormQuestion[] = [
  {
    id: 'question1',
    question: 'Та “Бизнесээ Томруулъя Комьюнити”-д нэгдэх гол шалтгаан юу вэ?',
    options: [
      'Сургалт, мэдлэг олж авах',
      'Туршлагатай бизнес эрхлэгчдээс суралцах',
      'Хамтын ажиллагаа, түнш олох',
      'Бизнесээ сурталчлах, борлуулалт нэмэх',
      'Шинэ санаа, инновацийн талаар мэдээлэл авах',
      'Бусад (нээлттэй текст)',
    ],
  },
  {
    id: 'question2',
    question: 'Таны бизнесийн хувьд хамгийн тулгамдаж буй асуудал юу вэ?',
    options: [
      'Борлуулалт ба маркетинг',
      'Санхүү ба төлөвлөлт',
      'Хүний нөөц, ажилтны ур чадвар',
      'Үйл ажиллагааны процесс',
      'Технологи, систем нэвтрүүлэлт',
      'Хууль эрх зүй, татвар',
      'Бусад (нээлттэй)',
    ],
  },
  {
    id: 'question3',
    question:
      'Танай байгууллага дараах шийдлүүдээс аль алиныг ашиглаж байна вэ?',
    options: [
      'CRM',
      'ERP',
      'POS',
      'E-commerce',
      'Social media automation',
      'Project management software',
      'Ашигладаггүй',
      'Бусад (нээлттэй)',
    ],
  },
  {
    id: 'question4',
    question: 'Танай бизнесийн гол борлуулалтын сувгууд юу вэ?',
    options: [
      'Дэлгүүрийн худалдаа',
      'Онлайн худалдаа / вэбсайт',
      'Facebook / Instagram',
      'TikTok / YouTube',
      'B2B борлуулалт',
      'Distributor / Franchise',
    ],
  },
  {
    id: 'question5',
    question:
      'Та комьюнити-гийн бусад гишүүдтэй хэрхэн хамтрахыг хүсэж байна вэ?',
    options: [
      'Хамтран бүтээгдэхүүн/үйлчилгээ хөгжүүлэх',
      'Cross-marketing',
      'Туршлага солилцох',
      'Хэрэглэгчийн урсгал солилцох',
      'Ментор/зөвлөгөө өгөх',
    ],
  },
  {
    id: 'question6',
    question: 'Та БТК комьюнити-с хамгийн их хүлээж буй үнэ цэнэ юу вэ?',
    options: [
      'Менторшип',
      'Нетворкинг',
      'Санхүүжилт / хөрөнгө оруулалтын боломж',
      'Технологийн дэмжлэг',
      'Сургалт, контент',
      'Хамтын төсөл, эвентэд оролцох',
    ],
  },
  {
    id: 'contact',
    question: 'Холбоо барих мэдээлэл',
    type: 'contact',
  },
];
