export const BLOCK_FORMS: Record<number, any> = {
  1: {
    title: 'BUYER / RENTER',
    questions: [
      {
        id: 1,
        text: 'Та ямар зориулалтаар байр хайж байна вэ?',
      },
      {
        id: 2,
        text: 'Та хаана байрлах байрыг сонирхож байна вэ?',
      },
      {
        id: 3,
        text: 'Таны ойролцоо төсөв хэд вэ?',
      },
      {
        id: 4,
        text: 'Та ямар төлбөрийн нөхцөл сонирхож байна вэ?',
      },
      {
        id: 5,
        text: 'Та ямар шатны байрыг илүүд үзэх вэ?',
      },
    ],
  },
  2: {
    title: 'DEVELOPER',
    questions: [
      {
        id: 1,
        text: 'Танай байгууллага ямар төрлийн төсөл хэрэгжүүлдэг вэ?',
      },
      {
        id: 2,
        text: 'Танай одоогийн төсөл ямар шатандаа байна вэ?',
      },
      {
        id: 3,
        text: 'Та голдуу ямар сувгаар борлуулдаг вэ?',
      },
    ],
  },
  3: {
    title: 'АГЕНТ',
    questions: [
      {
        id: 1,
        text: 'Та голчлон ямар төрлийн үл хөдлөхтэй ажилладаг вэ?',
      },
      {
        id: 2,
        text: 'Та нэг удаад хэдэн нэгж зардаг вэ?',
      },
      {
        id: 3,
        text: 'Манайхаас авах гол зорилго юу вэ?',
      },
    ],
  },
  4: {
    title: 'SUPPLIER',
    questions: [
      {
        id: 1,
        text: 'Таны нийлүүлдэг бүтээгдэхүүн/үйлчилгээ?',
      },
      {
        id: 2,
        text: 'Танай байгууллага ямар түвшний компани вэ?',
      },
      {
        id: 3,
        text: 'Та developer-тэй ямар байдлаар ажиллахыг хүсэж байна вэ?',
      },
      {
        id: 4,
        text: 'Та нийлүүлэлтээ хаана хийдэг вэ?',
      },
      {
        id: 5,
        text: 'Та манайхаас юу хүлээж байна вэ?',
      },
    ],
  },
  5: {
    title: 'INVESTORS',
    questions: [
      {
        id: 1,
        text: 'Та ямар төрлийн хөрөнгө оруулалт сонирхож байна вэ?',
      },
      {
        id: 2,
        text: 'Таны хөрөнгө оруулалтын төсөв хэд вэ?',
      },
      {
        id: 3,
        text: 'Та ямар эрсдэлийн түвшинд тохирох хөрөнгө оруулалт хайж байна вэ?',
      },
      {
        id: 4,
        text: 'Таны хүсэж буй жилийн өгөөж (ROI) хэд вэ?',
      },
      {
        id: 5,
        text: 'Та ямар хугацаанд хөрөнгө оруулах сонирхолтой вэ?',
      },
      {
        id: 6,
        text: 'Хаана байрлах үл хөдлөхийг илүүд үзэж байна вэ?',
      },
    ],
  },
};
